<?php
/*!
*
* roa.Const.Work.Calendar.php
* 锐拓OA - 常数集 - 工具 - 工作日历
*
*/

// 提醒
$anRemindConst = array(
    10 => '不提醒',
    20 => '当天',
    // 30 => '10分钟前',
    // 40 => '30分钟前',
    // 50 => '1个小时前',
    60 => '一天前',
    70 => '自定义',
);
// 重复
$anRepeatConst = array(
    10 => '不重复',
    20 => '每日',
    30 => '每工作日',
    40 => '每周',
    50 => '每月',
    60 => '每年',
);

// 星期几(固定数据)
$aWeekOfDayConst = array(
    0 => '星期日',
    1 => '星期一',
    2 => '星期二',
    3 => '星期三',
    4 => '星期四',
    5 => '星期五',
    6 => '星期六',
);

// 固定节日
$anFixedHolidayConst = array(
    '2024-01-01' => '元旦',
    '2024-02-09' => '除夕',
    '2024-02-10' => '春节',
    '2024-02-24' => '元宵节',
    '2024-03-08' => '妇女节',
    '2024-05-01' => '劳动节',
    '2024-06-10' => '端午节',
    '2024-09-17' => '中秋节',
    '2024-10-01' => '国庆节',
    '2024-10-11' => '重阳节',
    '2025-01-01' => '元旦',
    '2025-01-28' => '除夕',
    '2025-01-29' => '春节',
    '2025-02-12' => '元宵节',
    '2025-03-08' => '妇女节',
    '2025-04-05' => '清明节',
    '2025-05-01' => '劳动节',
    '2025-05-31' => '端午节',
    '2025-10-01' => '国庆节',
    '2025-10-06' => '中秋节',
    '2025-10-29' => '重阳节',
    '2026-01-01' => '元旦',
);
?>